<H>LAB EXERCISES</H>

importing the libraries required

In [1]:
import pandas as pd
import csv

Reading the data  of the tables from the csv files uploaded in the same drive as the jupyter notebook

In [2]:
#READING DATA FROM BBC TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED BBC

bbc=pd.read_csv("bbc.csv")

#READING DATA FROM WORLD TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED WORLD

world= pd.read_csv(filepath_or_buffer = 'world.csv', delimiter=',', 
                 doublequote=True, quotechar='"',na_values = ['na', '-', '.', ''], 
                 quoting=csv.QUOTE_ALL, encoding = "ISO-8859-1")

#READING DATA FROM ETEAM TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED ETEAM

eteam=pd.read_csv("eteam.csv",delimiter=',', 
                 doublequote=True, quotechar='"',na_values = ['na', '-', '.', ''], 
                 quoting=csv.QUOTE_ALL, encoding = "ISO-8859-1")

#READING DATA FROM GAME TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED GAME

game = pd.read_csv(filepath_or_buffer = 'game.csv')

#READING DATA FROM GOAL TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED GOAL

goal=pd.read_csv('goal.csv',delimiter=',', 
                 doublequote=True, quotechar='"',na_values = ['na', '-', '.', ''], 
                 quoting=csv.QUOTE_ALL, encoding = "ISO-8859-1")

#READING DATA FROM NOBEL TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED NOBEL

nobel=pd.read_csv('nobel.csv')

#READING DATA FROM MOVIES TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED MOVIES

movies=pd.read_csv("movies.csv")

Note by Professor
Data Wrangling and Data Analysis
Lab1 Exercises: Data Extraction
In this lab, we will use the 7 tables that Proffessor added on teams. Note: The queries that will write might not return records. Focus on writing the query correctly. Write the queries in both SQL and Python unless otherwise stated explicitly.

Question 1.
If you know that in the world table, the continent of the countries Armenia, Azerbaijan, Russia, Georgia and Turkey is not Europe. Write a query that returns the total area of the European countries after adding the area of these countries.

In [3]:
#looking at data from world table
world.head()

,name,continent,area,population,gdp,capital,tld,flag
0,Afghanistan,Asia,652230,25500100,2.036400e+10,Kabul,.af,//upload.wikimedia.org/wikipedia/commons/9/9a/...
1,Albania,Europe,28748,2821977,1.204400e+10,Tirana,.al,//upload.wikimedia.org/wikipedia/commons/3/36/...
2,Algeria,Africa,2381741,38700000,2.070210e+11,Algiers,.dz,//upload.wikimedia.org/wikipedia/commons/7/77/...
3,Andorra,Europe,468,76098,3.222000e+09,Andorra la Vella,.ad,//upload.wikimedia.org/wikipedia/commons/1/19/...
4,Angola,Africa,1246700,19183590,1.163080e+11,Luanda,.ao,//upload.wikimedia.org/wikipedia/commons/9/9d/...

In [30]:
europe_area=world['area'][world['continent']=='Europe'].sum()
new_area=(world['area'][world['name'].isin(['Armenia', "Azerbaijan", "Russia", "Georgia", "Turkey"])]).sum()
europe_area
new_area
total_area=europe_area+new_area

Question 2.
Write a query that returns the names of the players in the German team who scored at least one goal with the name of the stadium where they scored the goals.

In [5]:
#inspecting tables data
print(game.head())
print(goal.head())

     id      mdate                    stadium team1 team2
0  1001   8-Jun-12   National Stadium, Warsaw   POL   GRE
1  1002   8-Jun-12  Stadion Miejski (Wroclaw)   RUS   CZE
2  1003  12-Jun-12  Stadion Miejski (Wroclaw)   GRE   CZE
3  1004  12-Jun-12   National Stadium, Warsaw   POL   RUS
4  1005  16-Jun-12  Stadion Miejski (Wroclaw)   CZE   POL
   matchid teamid                player  gtime
0     1001    POL    Robert Lewandowski     17
1     1001    GRE  Dimitris Salpingidis     51
2     1002    RUS          Alan Dzagoev     15
3     1002    RUS        Roman Shirokov     24
4     1002    CZE          Václav Pilar     52

In [6]:
goal_game= pd.merge(game, goal, left_on='id', right_on='matchid')
goal_game.head()

,id,mdate,stadium,team1,team2,matchid,teamid,player,gtime
0,1001,8-Jun-12,"National Stadium, Warsaw",POL,GRE,1001,POL,Robert Lewandowski,17
1,1001,8-Jun-12,"National Stadium, Warsaw",POL,GRE,1001,GRE,Dimitris Salpingidis,51
2,1002,8-Jun-12,Stadion Miejski (Wroclaw),RUS,CZE,1002,RUS,Alan Dzagoev,15
3,1002,8-Jun-12,Stadion Miejski (Wroclaw),RUS,CZE,1002,RUS,Roman Shirokov,24
4,1002,8-Jun-12,Stadion Miejski (Wroclaw),RUS,CZE,1002,CZE,Václav Pilar,52

In [7]:
goal_game['gtime'].isnull().sum()
#no goal time is null ,so taking that minimum of 1 goal is done

0

In [26]:
#goal_game.loc[(goal_game['teamid']=='GER'),['player','stadium']]
goal_game[['player','stadium']][goal_game['teamid'] == 'GER']

            player                   stadium
15     Mario Gómez                Arena Lviv
21     Mario Gómez          Metalist Stadium
22     Mario Gómez          Metalist Stadium
27  Lukas Podolski                Arena Lviv
29     Lars Bender                Arena Lviv
61    Philipp Lahm          PGE Arena Gdansk
63    Sami Khedira          PGE Arena Gdansk
64  Miroslav Klose          PGE Arena Gdansk
65      Marco Reus          PGE Arena Gdansk
71      Mesut Özil  National Stadium, Warsaw

Question 3
Write a query which would show the players and their teams for those who have scored against France (FRA) in Donbass Arena.

In [9]:
goal_game.loc[:,['player', 'teamid', 'stadium']][(((goal_game['team1'] == 'FRA') | (goal_game['team2'] == 'FRA')) & (goal_game['teamid'] != 'FRA') & (goal_game['stadium'] == 'Donbass Arena'))]

            player teamid        stadium
45  Joleon Lescott    ENG  Donbass Arena
67     Xabi Alonso    ESP  Donbass Arena
68     Xabi Alonso    ESP  Donbass Arena

question:4 Write a query that displays the name and the the average population of the continent in the world table.

In [10]:
world.head()

,name,continent,area,population,gdp,capital,tld,flag
0,Afghanistan,Asia,652230,25500100,2.036400e+10,Kabul,.af,//upload.wikimedia.org/wikipedia/commons/9/9a/...
1,Albania,Europe,28748,2821977,1.204400e+10,Tirana,.al,//upload.wikimedia.org/wikipedia/commons/3/36/...
2,Algeria,Africa,2381741,38700000,2.070210e+11,Algiers,.dz,//upload.wikimedia.org/wikipedia/commons/7/77/...
3,Andorra,Europe,468,76098,3.222000e+09,Andorra la Vella,.ad,//upload.wikimedia.org/wikipedia/commons/1/19/...
4,Angola,Africa,1246700,19183590,1.163080e+11,Luanda,.ao,//upload.wikimedia.org/wikipedia/commons/9/9d/...

In [11]:
world[['continent','population']].groupby("continent").mean()

                 population
continent
Africa         1.917153e+07
Asia           9.240331e+07
Caribbean      3.286291e+06
Eurasia        7.450870e+07
Europe         1.386959e+07
North America  4.715956e+07
Oceania        2.698820e+06
South America  3.135531e+07

Question 5.
Write a query to return the number of missing values in each column of the world table [only in Python for now]. Use the world table

In [12]:
missing = world.isnull().sum()
missing

name          0
continent     0
area          0
population    0
gdp           6
capital       1
tld           0
flag          0
dtype: int64

Question 6.
Write a query that lists the countries with no missing values in their gdp. Use the world table.

In [27]:
world.head()

195

In [14]:
world.loc[:,['name','gdp']][(world['gdp'].notnull())]
#world[['name','gdp']][world['gdp'].notnull()]

            name           gdp
0    Afghanistan  2.036400e+10
1        Albania  1.204400e+10
2        Algeria  2.070210e+11
3        Andorra  3.222000e+09
4         Angola  1.163080e+11
..           ...           ...
190    Venezuela  3.824240e+11
191      Vietnam  1.558200e+11
192        Yemen  3.283100e+10
193       Zambia  2.149000e+10
194     Zimbabwe  9.802000e+09

[189 rows x 2 columns]

QUES;7Write a query that lists the countries with no missing values in any of their attributes [only in Python for now]. Use the world table.

In [15]:
#checking where there are null values in the dataframes
print(world.isnull().sum())
#extracting that part of dataframe
world.loc[:,['name']][(world['gdp'].notnull()) & (world['capital'].notnull())]

name          0
continent     0
area          0
population    0
gdp           6
capital       1
tld           0
flag          0
dtype: int64

            name
0    Afghanistan
1        Albania
2        Algeria
3        Andorra
4         Angola
..           ...
190    Venezuela
191      Vietnam
192        Yemen
193       Zambia
194     Zimbabwe

[189 rows x 1 columns]

Ques:8
Write a query to calculate the average budget for movies produced in USA since 2010 (incl. 2010). Use the movies table.

In [16]:
#inspecting the data
movies.head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0

In [17]:
print('The average budget for movies produced in USA since 2010 (incl. 2010) is ',(movies.loc[:,['budget']][(movies['country']=='USA') & (movies['title_year']>=2010)].mean()))

The average budget for movies produced in USA since 2010 (incl. 2010) is  budget    5.188213e+07
dtype: float64

Ques:9Write a query to count the number of unique directors by names. Use the movies table.

In [18]:
len(movies['director_name'].unique())
#movies['director_name'].nunique()

1893

Question 10.
Write a query that returns the years in which no Nobel price is given for physics. Use the nobel table.

In [19]:
nobel.head()

     yr     subject                        winner
0  1901   Chemistry  Jacobus Henricus van 't Hoff
1  1901  Literature               Sully Prudhomme
2  1901    Medicine        Emil Adolf von Behring
3  1901       Peace             Jean Henry Dunant
4  1901       Peace                Frédéric Passy

In [20]:
nobel.loc[:,'yr'][(nobel['subject'] =='Physics')]

5      1901
11     1902
12     1902
17     1903
18     1903
       ...
956    2015
957    2015
966    2016
967    2016
968    2016
Name: yr, Length: 222, dtype: int64

Question 11.
Write a query to count the number of Nobel price winners from Netherlands. Use nobel table.

In [21]:

#nobel.loc[:,'winner'][(nobel['country'] =='Netherlands')].sum()

Question 12.
Write a query to find the number of Nobel price winners of each country. Use nobel table.

In [22]:
#nobel[['winner','country']].groupby("country").sum()

Question 13.Write a query to count the number of Nobel prize winners in Physics.  Usenobel table.

In [38]:
nobel.loc[:,'winner'][(nobel['subject'] =='Physics')].count()

222

Question 14.Write a query to find the number of Nobel prize winners in each subject.  Use nobel table.

In [36]:
nobel.groupby('subject')['winner'].agg(['count'])

            count
subject
Chemistry     194
Economics      83
Literature    113
Medicine      227
Peace         130
Physics       222